Hi @morgante find all the details below:

**main.tf**
```
module "vpc" {
    source  = "terraform-google-modules/network/google"
    version = "~> 1.0.0"

    project_id   = var.project
    network_name = var.network_name
    routing_mode = "GLOBAL"

    subnets = [
        {
            subnet_name           = "subnet-01"
            subnet_ip             = var.master_ipv4_cidr_block
            subnet_region         = var.region
        },
    ]

    secondary_ranges = {
        subnet-01 = [
            {
                range_name    = "subnet-01-secondary-pods"
                ip_cidr_range = var.vpc_cidr_block
            },
            {
                range_name    = "subnet-01-secondary-services"
                ip_cidr_range = var.vpc_secondary_cidr_block
            },
        ]
    }

    routes = [
        {
            name                   = "egress-internet"
            description            = "route through IGW to access internet"
            destination_range      = "0.0.0.0/0"
            tags                   = "egress-inet"
            next_hop_internet      = "true"
        },
    ]
}

module "gke" {
  source                     = "terraform-google-modules/kubernetes-engine/google"
  version                    =  "4.0.0"
  project_id                 = var.project
  name                       = var.cluster_name
  region                     = var.region
  network                    = "${module.vpc.network_name}"
  subnetwork                 = "subnet-01"
  ip_range_pods              = "subnet-01-secondary-pods"
  ip_range_services          = "subnet-01-secondary-services"
  http_load_balancing        = false
  horizontal_pod_autoscaling = true
  kubernetes_dashboard       = false
  network_policy             = true
  service_account            = var.cluster_service_account_name
  regional                   = true

  node_pools = [
    {
      name               = "default-pool"
      machine_type       = "n1-standard-4"
      min_count          = 2
      max_count          = 3
      disk_size_gb       = 96
      disk_type          = "pd-standard"
      image_type         = "COS"
      auto_repair        = true
      auto_upgrade       = true
      service_account    = var.cluster_service_account_name
      preemptible        = false
      initial_node_count = 2
    },
  ]

  node_pools_oauth_scopes = {
    all = []

    default-pool = [
      "https://www.googleapis.com/auth/cloud-platform",
    ]
  }

  node_pools_labels = {
    all = {}

    default-pool = {
      default-pool = true
    }
  }

  node_pools_metadata = {
    all = {}

    default-pool = {
      node-pool-metadata-custom-value = "solinas-spinnaker"
    }
  }

  node_pools_taints = {
    all = []

    default-pool = [
      {
        key    = "default-pool"
        value  = true
        effect = "PREFER_NO_SCHEDULE"
      },
    ]
  }

  node_pools_tags = {
    all = []

    default-pool = [
      "default-pool",
    ]
  }
}
```

**Full logs:**
```
+ terraform init

Initializing modules...

Downloading terraform-google-modules/kubernetes-engine/google 4.1.0 for gke...

- gke in .terraform/modules/gke/terraform-google-modules-terraform-google-kubernetes-engine-1394bde

Downloading terraform-google-modules/network/google 1.0.0 for vpc...

- vpc in .terraform/modules/vpc/terraform-google-modules-terraform-google-network-4e7cd17



Initializing the backend...



Successfully configured the backend "gcs"! Terraform will automatically

use this backend unless the backend configuration changes.



Initializing provider plugins...

- Checking for available provider plugins...

- Downloading plugin for provider "google-beta" (terraform-providers/google-beta) 2.11.0...

- Downloading plugin for provider "random" (terraform-providers/random) 2.1.2...

- Downloading plugin for provider "null" (terraform-providers/null) 2.1.2...

- Downloading plugin for provider "kubernetes" (terraform-providers/kubernetes) 1.8.1...

- Downloading plugin for provider "google" (terraform-providers/google) 2.11.0...



The following providers do not have any version constraints in configuration,

so the latest version was installed.



To prevent automatic upgrades to new major versions that may contain breaking

changes, it is recommended to add version = "..." constraints to the

corresponding provider blocks in configuration, with the constraint strings

suggested below.



* provider.google: version = "~> 2.11"

* provider.google-beta: version = "~> 2.11"

* provider.kubernetes: version = "~> 1.8"

* provider.null: version = "~> 2.1"

* provider.random: version = "~> 2.1"



Terraform has been successfully initialized!



You may now begin working with Terraform. Try running "terraform plan" to see

any changes that are required for your infrastructure. All Terraform commands

should now work.



If you ever set or change modules or backend configuration for Terraform,

rerun this command to reinitialize your working directory. If you forget, other

commands will detect it and remind you to do so if necessary.

+ terraform plan

Refreshing Terraform state in-memory prior to plan...

The refreshed state will be used to calculate this plan, but will not be

persisted to local or remote state storage.



module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=none]

module.gke.data.google_client_config.default: Refreshing state...

module.gke.data.google_compute_zones.available: Refreshing state...

module.gke.data.google_compute_subnetwork.gke_subnetwork: Refreshing state...

module.vpc.google_compute_network.network: Refreshing state... [id=solinas-network]

module.gke.data.google_container_engine_versions.region: Refreshing state...

module.gke.random_shuffle.available_zones: Refreshing state... [id=-]

module.gke.data.google_container_engine_versions.zone: Refreshing state...

module.gke.data.google_compute_network.gke_network: Refreshing state...

module.vpc.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=europe-west5/subnet-01]

module.gke.google_container_cluster.primary[0]: Refreshing state... [id=c4core-sre-spinnaker]

module.vpc.google_compute_route.route[0]: Refreshing state... [id=egress-internet]

module.vpc.data.google_compute_subnetwork.created_subnets[0]: Refreshing state...



------------------------------------------------------------------------



An execution plan has been generated and is shown below.

Resource actions are indicated with the following symbols:

  + create



Terraform will perform the following actions:



  # module.gke.google_container_node_pool.pools[0] will be created

  + resource "google_container_node_pool" "pools" {

      + cluster             = "c4core-sre-spinnaker"

      + id                  = (known after apply)

      + initial_node_count  = 2

      + instance_group_urls = (known after apply)

      + location            = (known after apply)

      + max_pods_per_node   = (known after apply)

      + name                = "spinnaker-pool"

      + name_prefix         = (known after apply)

      + node_count          = (known after apply)

      + project             = "sap-se-cx-sre-sdev"

      + region              = "europe-west5"

      + version             = (known after apply)

      + zone                = (known after apply)



      + autoscaling {

          + max_node_count = 3

          + min_node_count = 2

        }



      + management {

          + auto_repair  = true

          + auto_upgrade = true

        }



      + node_config {

          + disk_size_gb      = 96

          + disk_type         = "pd-standard"

          + guest_accelerator = []

          + image_type        = "COS"

          + labels            = {

              + "cluster_name"   = "c4core-sre-spinnaker"

              + "node_pool"      = "spinnaker-pool"

              + "spinnaker-pool" = "true"

            }

          + local_ssd_count   = (known after apply)

          + machine_type      = "n1-standard-4"

          + metadata          = {

              + "cluster_name"                    = "c4core-sre-spinnaker"

              + "disable-legacy-endpoints"        = "true"

              + "node-pool-metadata-custom-value" = "solinas-spinnaker"

              + "node_pool"                       = "spinnaker-pool"

            }

          + oauth_scopes      = [

              + "https://www.googleapis.com/auth/cloud-platform",

            ]

          + preemptible       = false

          + service_account   = "spinnaker-galaxy-infra@sap-se-cx-sre-sdev.iam.gserviceaccount.com"

          + tags              = [

              + "gke-c4core-sre-spinnaker",

              + "gke-c4core-sre-spinnaker-spinnaker-pool",

              + "spinnaker-pool",

            ]



          + taint {

              + effect = "PREFER_NO_SCHEDULE"

              + key    = "spinnaker-pool"

              + value  = "true"

            }

        }



      + timeouts {

          + create = "30m"

          + delete = "30m"

          + update = "30m"

        }

    }



  # module.gke.null_resource.wait_for_regional_cluster[0] will be created

  + resource "null_resource" "wait_for_regional_cluster" {

      + id = (known after apply)

    }



Plan: 2 to add, 0 to change, 0 to destroy.



------------------------------------------------------------------------



Note: You didn't specify an "-out" parameter to save this plan, so Terraform

can't guarantee that exactly these actions will be performed if

"terraform apply" is subsequently run.



+ terraform apply -auto-approve '-input=false'

module.gke.data.google_container_engine_versions.region: Refreshing state...

module.gke.data.google_compute_zones.available: Refreshing state...

module.gke.data.google_client_config.default: Refreshing state...

module.gke.data.google_compute_subnetwork.gke_subnetwork: Refreshing state...

module.vpc.google_compute_network.network: Refreshing state... [id=solinas-network]

module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=none]

module.vpc.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=europe-west5/subnet-01]

module.gke.data.google_compute_network.gke_network: Refreshing state...

module.gke.random_shuffle.available_zones: Refreshing state... [id=-]

module.gke.data.google_container_engine_versions.zone: Refreshing state...

module.gke.google_container_cluster.primary[0]: Refreshing state... [id=c4core-sre-spinnaker]

module.vpc.data.google_compute_subnetwork.created_subnets[0]: Refreshing state...

module.vpc.google_compute_route.route[0]: Refreshing state... [id=egress-internet]

module.gke.google_container_node_pool.pools[0]: Creating...

module.gke.google_container_node_pool.pools[0]: Still creating... [10s elapsed]

module.gke.google_container_node_pool.pools[0]: Still creating... [20s elapsed]

module.gke.google_container_node_pool.pools[0]: Still creating... [30s elapsed]

module.gke.google_container_node_pool.pools[0]: Still creating... [40s elapsed]

module.gke.google_container_node_pool.pools[0]: Still creating... [50s elapsed]

module.gke.google_container_node_pool.pools[0]: Still creating... [1m0s elapsed]

module.gke.google_container_node_pool.pools[0]: Still creating... [1m10s elapsed]

module.gke.google_container_node_pool.pools[0]: Still creating... [1m20s elapsed]

module.gke.google_container_node_pool.pools[0]: Still creating... [1m30s elapsed]

module.gke.google_container_node_pool.pools[0]: Creation complete after 1m37s [id=europe-west5/c4core-sre-spinnaker/spinnaker-pool]

module.gke.null_resource.wait_for_regional_cluster[0]: Creating...

module.gke.null_resource.wait_for_regional_cluster[0]: Provisioning with 'local-exec'...

module.gke.null_resource.wait_for_regional_cluster[0] (local-exec): Executing: ["/bin/sh" "-c" ".terraform/modules/gke/terraform-google-modules-terraform-google-kubernetes-engine-1394bde/scripts/wait-for-cluster.sh sap-se-cx-sre-sdev c4core-sre-spinnaker"]

module.gke.null_resource.wait_for_regional_cluster[0] (local-exec): /bin/sh: .terraform/modules/gke/terraform-google-modules-terraform-google-kubernetes-engine-1394bde/scripts/wait-for-cluster.sh: not found





Error: Error running command '.terraform/modules/gke/terraform-google-modules-terraform-google-kubernetes-engine-1394bde/scripts/wait-for-cluster.sh sap-se-cx-sre-sdev c4core-sre-spinnaker': exit status 127. Output: /bin/sh: .terraform/modules/gke/terraform-google-modules-terraform-google-kubernetes-engine-1394bde/scripts/wait-for-cluster.sh: not found

```